// Задача № 1
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

// Console.WriteLine ("Задача на определение палиндрома, необходимо ввести число");
// Console.WriteLine ("Введите пятизначное число");
// int numA = Convert.ToInt32(Console.ReadLine());



// необходимо сравнить края числа



// if (numN%2==0)
// Console.WriteLine("Четное");
// else 
// Console.WriteLine("Нечетное");



// Задача № 2
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

// необходимо добавить ya, yb к задаче с семинара

// double FindDistance (double xa, double ya, double xb, double yb, double za, double zb)
// {
//     return Math.Sqrt(Math.Pow(xb-xa, 2) + Math.Pow(yb-ya, 2) + Math.Pow(zb-za, 2));
// }

// Console.WriteLine("Input coordinate x for first point:");
// double xa = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input coordinate x for second point:");
// double xb = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input coordinate y for first point:");
// double ya = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input coordinate y for second point:");
// double yb = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input coordinate z for first point:");
// double za = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input coordinate z for second point:");
// double zb = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine($"Distance between our points -> {FindDistance(xa,ya,za,xb,yb,zb)}");

// Задача № 2 решена по примеру задачи с семинара с добавлением точки в третьем векторе измерения



// Задача № 3
// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.


// семинар 1 использовались квадраты