// Задача № 1
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

Console.WriteLine ("Задача на определение палиндрома, необходимо ввести число");
Console.WriteLine ("Введите пятизначное число");
int numA = Convert.ToInt32(Console.ReadLine());



// необходимо сравнить края числа



// if (numN%2==0)
// Console.WriteLine("Четное");
// else 
// Console.WriteLine("Нечетное");



// Задача № 2
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

// необходимо добавить ya, ybк задаче с семинара




// Задача № 3
// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.


// семинар 1 использовались квадраты